[{
  "_id": {
    "$oid": "5f002ede0c5d145b0cab4b18"
  },
  "title": "Bootstrap",
  "desc_1": "Learn Bootstrap by creating an advanced Bootstrap 4 Responsive Website Template from scratch, with no steps skipped!",
  "desc_2": "This course will show you how to make a complete Bootstrap 4 Template from scratch starting with blank HTML, CSS and JavaScript files!  We'll be moving rapidly to give you the quickest, yet most thorough Bootstrap website building experience possible.  Once you've completed the course you'll be able to design and develop you're own Bootstrap 4 templates and themes.",
  "quiz": 14,
  "difficulty": "Beginner",
  "image": "images/bootstrap.png",
  "number": 8,
  "video": "https://www.youtube.com/watch?v=t0OYpyKW-HI&feature=emb_title"
},{
  "_id": {
    "$oid": "5f003b890c5d145b0cab4b19"
  },
  "title": "MongoDB",
  "desc_1": "Master MongoDB Development for Web & Mobile Apps. CRUD Operations, Indexes, Aggregation Framework - All about MongoDB!",
  "desc_2": "MongoDB is one of the most important NoSQL databases you can work with these days. It's extremely popular and MongoDB developers are in high demand.  No matter if you're building web applications, mobile applications or any other kind of application or if you're a data scientist - you'll need to work with data. Storing data, querying it efficiently and minimizing complexities whilst optimizing performance are crucial tasks.  MongoDB makes working with data simple - it's built on a philosophy that prioritizes performance and efficiency.  In this course, you'll learn all about MongoDB from scratch. No prior MongoDB or database experience is required!",
  "quiz": 7,
  "difficulty": "Beginner",
  "image": "images/mongodb.png",
  "number": 1,
  "video": "https://www.youtube.com/watch?v=HitWk5bXomk&feature=emb_title"
},{
  "_id": {
    "$oid": "5f003bac0c5d145b0cab4b1a"
  },
  "title": "React part 1",
  "desc_1": "Learn Modern React 16.8+ Including Hooks, Context API, Full Stack MERN & Redux By Building Real Life Projects",
  "desc_2": "In this course you will learn to master React 16.8+ concepts including how to create a Flux pattern using the Context API with the useContext and useReducer hooks. We will also build a full stack MERN application with a custom Express backend API that uses JWT (JSON Web Token) for authentication. In addition, we will also create a project that uses Redux.",
  "quiz": 9,
  "difficulty": "Intermediate",
  "image": "images/react.png",
  "video": false,
  "number": 3
},{
  "_id": {
    "$oid": "5f003bc90c5d145b0cab4b1b"
  },
  "title": "React part 2",
  "desc_1": "Learn how to build and launch React web applications using React, Redux, Webpack, React-Router, and more!",
  "desc_2": "Using the latest version of React, this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore. Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies.  We guarantee you this is the most comprehensive online resource on React. This project based course will introduce you to all of the modern toolchain of a React developer in 2020. Along the way, we will build a massive e-commerce application similar to Shopify using React, Redux, React Hooks, React Suspense, React Router, GraphQL, Context API, Firebase, Redux-Saga, Stripe + more. This is going to be a full stack app (MERN stack), using Firebase.  The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional React project all the way into production. We will start from the very beginning by teaching you React Basics and then going into advanced topics so you can make good decisions on architecture and tools on any of your future ReactJS projects.  All code is going to be provided step by step and even if you don’t like to code along, you will get access to the the full master project code so anyone signed up for the course will have their own project to put on their portfolio right away.",
  "video": "https://youtu.be/wdpo7fTJc3k",
  "difficulty": "Intermediate",
  "image": "images/react.png",
  "number": 1,
  "quiz": 7
},{
  "_id": {
    "$oid": "5f003c4a0c5d145b0cab4b1c"
  },
  "title": "Flask part 1",
  "desc_1": "Build professional REST APIs with Python, Flask, Flask-RESTful, and Flask-SQLAlchemy",
  "desc_2": "Are you tired of boring, outdated, incomplete, or incorrect tutorials? I say no more to copy-pasting code that you don’t understand.  Welcome to one of the best resources online on creating REST APIs. I'm Jose, and I'm a software engineer; here to help you truly understand and develop your skills in web and REST API development with Python, using Flask.  Production-ready REST APIs with Flask  This course will guide you in creating simple, intermediate, and advanced REST APIs including authentication, deployments, caching, and much more.  We'll start with a Python refresher that will take you from the very basics to some of the most advanced features of Python—that's all the Python you need to complete the course.  Using Flask and popular extensions Flask-RESTful, Flask-JWT, and Flask-SQLAlchemy we will dive right into developing complete, solid, production-ready REST APIs.  We will also look into essential technologies Git, Heroku, and nginx.",
  "quiz": 7,
  "video": "https://www.youtube.com/watch?v=pPicYXxYxZg&feature=emb_title",
  "difficulty": "Advanced",
  "image": "images/flask.png",
  "number": 8
},{
  "_id": {
    "$oid": "5f003c930c5d145b0cab4b1d"
  },
  "title": "Flask part 2",
  "desc_1": "Create awesome websites using the powerful Flask framework for Python!",
  "desc_2": "This course will be your complete definitive guide for developing fully functional websites with the Flask web framework. We'll start with crash courses in the basic front end technologies for HTML, CSS, and Boostrap 4. Once you have a good understanding of the basics of these front end technologies, we'll begin our journey with Python and Flask. The course includes a complete Python refresher that starts with the very basics and quickly takes you through the advanced features, including functions, decorators, object oriented programming, and more!  Once we understand HTML, CSS, Bootstrap 4, and Python we're ready to tackle Flask and learn about all the amazing features it has! We'll create basic landing pages with Flask and Python, then show you how to connect templates to Flask do you can connect your Flask Application to HTML, CSS, and Bootstrap based templates. We'll also cover how to use the Jinja template engine to directly connect your flask application to your front end files to customize your websites.  Then we'll learn how to create forms to accept user information, how to save that information to a SQL database, and relay it back to the user.  This course includes a fully complete Social Network project that includes, User Logins, Followers, Authentication, Blueprints, Templates, SQL Databases, and more!",
  "quiz": 3,
  "video": "https://www.youtube.com/watch?v=kyR1KYte-f4&feature=emb_title",
  "difficulty": "Advanced",
  "image": "images/flask.png",
  "number": 7
},{
  "_id": {
    "$oid": "5f003cb80c5d145b0cab4b1e"
  },
  "title": "Dash",
  "desc_1": "Learn how to create interactive plots and intelligent dashboards with Plotly, Python, and the Dash library!",
  "desc_2": "Welcome to Python Visualization Dashboards with Plotly's Dash Library!  This course will teach your everything you need to know to use Python to create interactive dashboard's with Plotly's new Dash library! Have you ever wanted to take your Python skills to the next level in data visualization? With this course you will be able to create fully customization, interactive dashboards with the open source libraries of Plotly and Dash.  Dash instructional courses from Plotly usually cost more than $1000, but now you can get the bootcamp experience for a fraction of that price in this self-paced course that includes example code, explanatory videos, student support in our chat channels, Question and Answer Forums, and interactive exercises.  We'll start off by teaching you enough Numpy and Pandas that you feel comfortable working and generating data in our quick crash course. Then we'll continue by teaching you about basic data visualization with Plotly, including scatter plots, line charts, bar charts, bubble charts, box plots, histograms, distribution plots, heat maps, and more! We'll also give you an intuition of when to use each plot type.",
  "quiz": 7,
  "difficulty": "Advanced",
  "image": "images/dash.png",
  "video": false,
  "number": 3
},{
  "_id": {
    "$oid": "5f00980f0c5d145b0cab4b20"
  },
  "title": "MongoDB",
  "desc_1": "NEW COURSE 2020! Master MongoDB database using JavaScript Mongo Shell, Robo 3T (Robomongo) and MongoDB Compass",
  "desc_2": "Building fullstack applications (i.e. frontend + backend) with the MERN stack is very popular - in this course, you will learn it from scratch at the example of a complete project!  MERN stands for MongoDB, Express.js, React.js and Node.js - and combined, these four technologies allow you to build amazing web applications.  In this course, we'll build an entire project and you will learn how these different technologies work together step by step. We'll first have a look at all the individual building blocks, so that we then can also combine them all into one amazing application by the end of the course.  This course also doesn't stop after the basics - instead, you'll also learn how to add file upload, authentication, authorization and how to deploy your application in different ways to different hosting services.  This course is taught by two instructors - Max (React.js, Node/ Express) and Manuel (MongoDB) who have years of experience of working with these technologies and teaching them to other people. We took and combined our experiences to deliver you the best possible MERN stack course you can find out there.",
  "quiz": 9,
  "difficulty": "Intermediate",
  "image": "images/mongodb.png",
  "video": "https://www.youtube.com/watch?v=zfWWk6G4rt4&feature=emb_title",
  "number": 9
}]